export const menu = [
  {
    name: "Любимые жанры",
    genre: "",
  },
  {
    name: "Захватывающие сюжеты",
    genre: "",
  },
  {
    name: "Неожиданные концовки",
    genre: "",
  },
];

export const cards = [
  {
    id: 0,
    imgUrl:"https://avatars.mds.yandex.net/get-kinopoisk-image/1946459/bf93b465-1189-4155-9dd1-cb9fb5cb1bb5/300x450",
    filmUrl: "https://www.kinopoisk.ru/film/535341/",
    title: "1+1 (2011)",
    genre: "Comedy",
    desc: "Пострадав в результате несчастного случая, богатый аристократ Филипп нанимает в помощники человека, который менее всего подходит для этой работы, – молодого жителя предместья Дрисса, только что освободившегося из тюрьмы. Несмотря на то, что Филипп прикован к инвалидному креслу, Дриссу удается привнести в размеренную жизнь аристократа дух приключений.",
  },

  {
    id: 1,
    imgUrl:
      "https://avatars.mds.yandex.net/get-kinopoisk-image/1599028/4057c4b8-8208-4a04-b169-26b0661453e3/300x450",
      filmUrl: "https://www.kinopoisk.ru/film/435/",
    title: "Зеленая миля (1999)",
    genre: "Drama",
    desc: "Пол Эджкомб — начальник блока смертников в тюрьме «Холодная гора», каждый из узников которого однажды проходит «зеленую милю» по пути к месту казни. Пол повидал много заключённых и надзирателей за время работы. Однако гигант Джон Коффи, обвинённый в страшном преступлении, стал одним из самых необычных обитателей блока.",
  },
  {
    id: 2,
    imgUrl:
      "https://avatars.mds.yandex.net/get-kinopoisk-image/1599028/3560b757-9b95-45ec-af8c-623972370f9d/300x450",
      filmUrl: "https://www.kinopoisk.ru/film/448/",
    title: "Форрест Гамп (1994)",
    genre: "Comedy",
    desc: "Сидя на автобусной остановке, Форрест Гамп — не очень умный, но добрый и открытый парень — рассказывает случайным встречным историю своей необыкновенной жизни. С самого малолетства парень страдал от заболевания ног, соседские мальчишки дразнили его, но в один прекрасный день Форрест открыл в себе невероятные способности к бегу. Подруга детства Дженни всегда его поддерживала и защищала, но вскоре дороги их разошлись.",
  },
  {
    id: 3,
    imgUrl:
      "https://avatars.mds.yandex.net/get-kinopoisk-image/6201401/ae3b699c-3db7-4196-a869-39b610bfe706/300x450",
      filmUrl: "https://www.kinopoisk.ru/film/370/",
    title: "Унесённые призраками (2001)",
    genre: "Drama",
    desc: "Тихиро с мамой и папой переезжает в новый дом. Заблудившись по дороге, они оказываются в странном пустынном городе, где их ждет великолепный пир. Родители с жадностью набрасываются на еду и к ужасу девочки превращаются в свиней, став пленниками злой колдуньи Юбабы. Теперь, оказавшись одна среди волшебных существ и загадочных видений, Тихиро должна придумать, как избавить своих родителей от чар коварной старухи.",
  },
  {
    id: 4,
    imgUrl:
      "https://avatars.mds.yandex.net/get-kinopoisk-image/1600647/430042eb-ee69-4818-aed0-a312400a26bf/300x450",
      filmUrl: "https://www.kinopoisk.ru/film/258687/",
    title: "Интерстеллар (2014)",
    genre: "Triller",
    desc: "Когда засуха, пыльные бури и вымирание растений приводят человечество к продовольственному кризису, коллектив исследователей и учёных отправляется сквозь червоточину (которая предположительно соединяет области пространства-времени через большое расстояние) в путешествие, чтобы превзойти прежние ограничения для космических путешествий человека и найти планету с подходящими для человечества условиями.",
  },
  {
    id: 5,
    imgUrl:
      "https://avatars.mds.yandex.net/get-kinopoisk-image/1898899/8ef070c9-2570-4540-9b83-d7ce759c0781/300x450",
      filmUrl: "https://www.kinopoisk.ru/film/361/",
    title: "Бойцовский клуб (1999)",
    genre: "Triller",
    desc: "Сотрудник страховой компании страдает хронической бессонницей и отчаянно пытается вырваться из мучительно скучной жизни. Однажды в очередной командировке он встречает некоего Тайлера Дёрдена — харизматического торговца мылом с извращенной философией. Тайлер уверен, что самосовершенствование — удел слабых, а единственное, ради чего стоит жить, — саморазрушение. Проходит немного времени, и вот уже новые друзья лупят друг друга почем зря на стоянке перед баром, и очищающий мордобой доставляет им высшее блаженство. Приобщая других мужчин к простым радостям физической жестокости, они основывают тайный Бойцовский клуб, который начинает пользоваться невероятной популярностью.",
  },
  {
    id: 6,
    imgUrl:
      "https://avatars.mds.yandex.net/get-kinopoisk-image/1900788/87b5659d-a159-4224-9bff-d5a5d109a53b/300x450",
      filmUrl: "https://www.kinopoisk.ru/film/342/",
    title: "Криминальное чтиво (1994)",
    genre: "Drama",
    desc: "Двое бандитов Винсент Вега и Джулс Винфилд ведут философские беседы в перерывах между разборками и решением проблем с должниками криминального босса Марселласа Уоллеса. В первой истории Винсент проводит незабываемый вечер с женой Марселласа Мией. Во второй рассказывается о боксёре Бутче Кулидже, купленном Уоллесом, чтобы сдать бой. В третьей истории Винсент и Джулс по нелепой случайности попадают в неприятности.",
  },
  {
    id: 7,
    imgUrl:
      "https://avatars.mds.yandex.net/get-kinopoisk-image/4303601/e410c71f-baa1-4fe5-bb29-aedb4662f49b/300x450",
      filmUrl: "https://www.kinopoisk.ru/film/3498/",
    title: "Властелин колец: Возвращение короля (2003)",
    genre: "Fantasy",
    desc: "Повелитель сил тьмы Саурон направляет свою бесчисленную армию под стены Минас-Тирита, крепости Последней Надежды. Он предвкушает близкую победу, но именно это мешает ему заметить две крохотные фигурки — хоббитов, приближающихся к Роковой Горе, где им предстоит уничтожить Кольцо Всевластья.",
  },
  {
    id: 8,
    imgUrl:
      "https://avatars.mds.yandex.net/get-kinopoisk-image/1946459/7ade06a8-4178-4386-9ee2-87fec5a172eb/300x450",
      filmUrl: "https://www.kinopoisk.ru/film/430/",
    title: "Шрэк (2001)",
    genre: "Fantasy",
    desc: "Жил да был в сказочном государстве большой зеленый великан по имени Шрэк. Жил он в гордом одиночестве в лесу, на болоте, которое считал своим. Но однажды злобный коротышка  лорд Фаркуад, правитель волшебного королевства, безжалостно согнал на Шрэково болото всех сказочных обитателей. И беспечной жизни зеленого великана пришел конец. Но лорд Фаркуад пообещал вернуть Шрэку болото, если великан добудет ему прекрасную принцессу Фиону, которая томится в неприступной башне, охраняемой огнедышащим драконом.",
  },
  {
    id: 9,
    imgUrl:
      "https://avatars.mds.yandex.net/get-kinopoisk-image/1946459/399bb0c1-2ac5-46ca-9efd-50d8708e2809/300x450",
      filmUrl: "https://www.kinopoisk.ru/film/49684/",
    title: "Ходячий замок (2004)",
    genre: "Fantasy",
    desc: "Злая ведьма заточила 18-летнюю Софи в тело старухи. Девушка-бабушка бежит из города куда глаза глядят и встречает удивительный дом на ножках, где знакомится с могущественным волшебником Хаулом и демоном Кальцифером. Кальцифер должен служить Хаулу по договору, условия которого он не может разглашать. Девушка и демон решают помочь друг другу избавиться от злых чар.",
  },
  {
    id: 10,
    imgUrl:
      "https://avatars.mds.yandex.net/get-kinopoisk-image/4774061/1a920451-e765-41e9-81aa-78438e82abbc/300x450",
      filmUrl: "https://www.kinopoisk.ru/film/280172/",
    title: "Как приручить дракона (2010)",
    genre: "Triller",
    desc: "Вы узнаете историю подростка Иккинга, которому не слишком близки традиции его героического племени, много лет ведущего войну с драконами. Мир Иккинга переворачивается с ног на голову, когда он неожиданно встречает дракона Беззубика, который поможет ему и другим викингам увидеть привычный мир с совершенно другой стороны…",
  },
  {
    id: 11,
    imgUrl:
      "https://avatars.mds.yandex.net/get-kinopoisk-image/6201401/1e1ac6d9-c658-4f5f-937e-d080bca0d893/300x450",
      filmUrl: "https://www.kinopoisk.ru/film/329/",
    title: "Список Шиндлера (1993)",
    genre: "Drama",
    desc: "Фильм рассказывает реальную историю загадочного Оскара Шиндлера, члена нацистской партии, преуспевающего фабриканта, спасшего во время Второй мировой войны почти 1200 евреев.",
  },
  {
    id: 12,
    imgUrl:
      "https://avatars.mds.yandex.net/get-kinopoisk-image/6201401/8662d92a-5881-4600-a7ae-549e6fd53b03/300x450",
      filmUrl: "https://www.kinopoisk.ru/film/389/",
    title: "Леон (1994)",
    genre: "Drama",
    desc: "Профессиональный убийца Леон неожиданно для себя самого решает помочь 12-летней соседке Матильде, семью которой убили коррумпированные полицейские.",
  },
  {
    id: 13,
    imgUrl:
      "https://avatars.mds.yandex.net/get-kinopoisk-image/6201401/a2d5bcae-a1a9-442f-8195-f5373a5ba77f/300x450",
      filmUrl: "https://www.kinopoisk.ru/film/328/",
    title: "Властелин колец: Братство Кольца (2001)",
    genre: "Fantasy",
    desc: "Сказания о Средиземье  это хроника Великой войны за Кольцо, длившейся не одну тысячу лет. Тот, кто владел Кольцом, получал неограниченную власть, но был обязан служить злу. Тихая деревня, где живут хоббиты. Придя на 111-й день рождения к своему старому другу Бильбо Бэггинсу, волшебник Гэндальф начинает вести разговор о кольце, которое Бильбо нашел много лет назад. Это кольцо принадлежало когда-то темному властителю Средиземья Саурону, и оно дает большую власть своему обладателю. Теперь Саурон хочет вернуть себе власть над Средиземьем. Бильбо отдает Кольцо племяннику Фродо, чтобы тот отнёс его к Роковой Горе и уничтожил.",
  },
  {
    id: 14,
    imgUrl:
      "https://avatars.mds.yandex.net/get-kinopoisk-image/4303601/617303b7-cfa7-4273-bd1d-63974bf68927/300x450",
      filmUrl: "https://www.kinopoisk.ru/film/397667/",
    title: "Остров проклятых (2009)",
    genre: "Triller",
    desc: "Два американских судебных пристава отправляются на один из островов в штате Массачусетс, чтобы расследовать исчезновение пациентки клиники для умалишенных преступников. При проведении расследования им придется столкнуться с паутиной лжи, обрушившимся ураганом и смертельным бунтом обитателей клиники.",
  },
  {
    id: 15,
    imgUrl:
      "https://avatars.mds.yandex.net/get-kinopoisk-image/6201401/772093e4-7f68-49aa-a805-d654693aee26/300x450",
      filmUrl: "https://www.kinopoisk.ru/film/312/",
    title: "Властелин колец: Две крепости (2002)",
    genre: "Fantasy",
    desc: "Братство распалось, но Кольцо Всевластья должно быть уничтожено. Фродо и Сэм вынуждены довериться Голлуму, который взялся провести их к вратам Мордора. Громадная армия Сарумана приближается: члены братства и их союзники готовы принять бой. Битва за Средиземье продолжается.",
  },
  {
    id: 16,
    imgUrl:
      "https://avatars.mds.yandex.net/get-kinopoisk-image/1704946/37b64a1f-999e-400b-a7db-e6dde3d68416/300x450",
      filmUrl: "https://www.kinopoisk.ru/film/57000/",
    title: "Развод по-итальянски (1961)",
    genre: "Comedy",
    desc: "Фердинандо приличный семьянин, ему скоро 40 лет, их брак с Росалией длится уже 12 лет, и вроде бы всё идет своим чередом, но вот беда, он влюбляется в свою юную кузину Анжелу, и девушка отвечает ему взаимностью. Фердинандо решает расстаться с ненавистной - глупой женой, чтобы быть всегда вместе с Анжелой, но как это сделать? Развод в Италии практически невозможен. «Проще убить», - решает он и, разработав коварный план, герой начинает действовать.",
  },
  {
    id: 17,
    imgUrl:
      "https://avatars.mds.yandex.net/get-kinopoisk-image/1599028/ef0983aa-3253-48d3-9b5d-c93dc12dce30/300x450",
      filmUrl: "https://www.kinopoisk.ru/film/57117/",
    title: "Обгон (1962)",
    genre: "Comedy",
    desc: "Роберто, застенчивый студент-юрист помимо собственной воли оказывается вовлеченным в «сладкую жизнь». Капризный и эксцентричный богач Бруно берет его в автомобильное путешествие по Риму и Тоскане. Они проведут вместе всего два дня и навестят семьи друг друга. За это короткое время Роберто повзрослеет и неожиданно осознает, что внешне удачливый и довольный жизнью Бруно глубоко несчастный человек.",
  },
];

export const description = {
  comedy:
    "Жанр комедии очень универсален и может включать в себя широкий спектр стилей юмора: от фарса, остроумных диалогов, сатиры, абсурдного/сюрреалистического юмора и пародии до романтической комедии. Персонажи изображают преувеличенных и эксцентричных людей в странных сценариях. Они включают юмор с использованием визуальных приколов, физической комедии, острот, забавных пародий или акцентов. ",
  triller:
    "Центральной темой триллеров является напряжение: оно держит зрителей в напряжении под нарастающее напряжение и тревожную музыку. Сюжеты обычно рассказывают о преступлениях, тайнах или шпионаже с непредсказуемыми антагонистами и кульминацией с высокими ставками. Они противопоставляют героя/героиню загадочному охотнику, который, кажется, знает каждое их движение.",
  drama:
    "Жанр драмы часто затрагивает такие тяжелые темы, как любовь, цель, мораль, несправедливость, общность, горе и что значит жить. Они подчеркивают человеческие отношения, эмоции, внутренние черты характера и моральные/этические дилеммы. Тон может быть серьезным, иногда меланхоличным, поскольку персонажи борются с трудностями/жизненными уроками. В этом жанре эмоциональная глубина и тонкость игры/реакций ценятся выше визуальной зрелищности.",
  fantasy:
    "От далеких галактик до антиутопического будущего — научная фантастика расширяет наше воображение технологиями, которые на данный момент превосходят человеческие возможности. Действие многих фильмов происходит среди планет, космических станций и космических кораблей с инопланетными мирами. Фильмы о путешествиях во времени, параллельные вселенные, антиутопии и социальные изменения занимают центральное место в научно-фантастических сюжетах.",
};
